<?php

$error_list = array(
    '101' => '方法不存在,请检查版本是否正确',
    '102' => '控制器不存在',
    '103' => '文件夹不存在',
    '104' => '无数据',
    '105' => '参数名称错误或参数为空',
    '20002' => '用户已被注册',
    '20003' => '手机已被注册',
    '20004' => '用户未注册',
    '20005' => '用户微信数据不存在',
    '30001' => '订单总金额不能为空或小于0',
    '30002' => '预约时间不能为空',
    '30003' => '订单编号不能为空',
    '30004' => '传递应为数组',
    '30005' => '不能预约,已有正在进行的订单',
    '30006' => '商户id 和  open_id 不能为空',
    '30007' => '无订单号',
    '40001' => '兑换积分不够',
    '40002' => '无数据',
    '50001' => '今天已经签到过了～～～',
    '50002' => '找不到该用户的签到数据',
    '60001' => '优惠券不存在',
    '60002' => '用户无领取过优惠券记录',
    '70001' => '无礼品信息',
    '70002' => '你现在不能玩该游戏,此游戏1天只能游玩1次',
    '80001' => '优惠数据不存在',
);


return $error_list;
?>