<?php

$error_list = array(


	'100'=>'成功',

	'101'=>'方法不存在,请检查版本是否正确',

	'102'=>'控制器不存在',

	'103'=>'文件夹不存在',

	'104'=>'无数据',

	'105'=>'名称为空或名称不对',

	'10001'=>'open_id 和  来源 缺少',
	'10002'=>'open_id 缺少',
	'10003'=>'open_id 和 积分 缺少',
	'10004'=>'open_id 和 金钱 缺少',

	'20001'=>'用户接口 传递数据错误 某些字段为空',
	'20002'=>'用户已被注册',
	'20003'=>'手机已被注册',


	'30001'=>'订单总金额不能为空或小于0',
	'30002'=>'预约时间不能为空',
	'30003'=>'订单编号不能为空',
	'30004'=>'传递应为数组',
	'30005'=>'不能预约,已有正在进行的订单',
	'30006'=>'商户id 和  open_id 不能为空',

	'30007'=>'无订单号',

	'40001'=>'兑换积分不够',
	'40002'=>'无数据',

);


return $error_list;


?>